content/Notes/FFmpeg.org
#+TITLE: FFmpeg
#+AUTHOR: Haider Mirza
#+DESCRIPTION: A Extremely powerful tool to edit Media.

* About
FFmpeg is a complete, cross-platform solution to record, convert and stream audio and video. It includes libavcodec - the leading audio/video codec library.
** Links
https://wiki.archlinux.org/title/FFmpeg
* Commands
I do not need to learn it's commands and I have been given this command to download and convert videos to a format which is supported by my Nokia.

ffmpeg -i in.mp4 -r 10 -y -vf scale=352x288 -b:v 50k -ar 8000 -ac 1 out.3gp

I personally have made a bash script to automate it for me (It is called Nokia.)
